Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Quarkus extension dependencies are divided into the runtime extension dependencies that end up on the application runtime classpath and the deployment (or build time) extension dependencies that are resolved by Quarkus only at application build time to create the build classpath. Application developers are expected to express dependencies only on the runtime artifacts of Quarkus extensions. As a consequence, the deployment extension dependencies aren't visible to Maven plugins that aren't aware of the Quarkus extension dependency model, such as the `maven-dependency-plugin`, `go-offline-maven-plugin`, etc. That means those plugins can not be used to pre-download all the application dependencies to be able to build and test the application later in offline mode.
ja_jp: Quarkus エクステンションの依存関係は、アプリケーションの実行時クラスパスに到達する実行時エクステンションの依存関係と、アプリケーションのビルド時にのみ Quarkus によって解決されてビルドクラスパスを作成するデプロイメント (またはビルド時) のエクステンションの依存関係に分けられます。アプリケーション開発者は、Quarkus エクステンションのランタイムアーティファクトにのみ依存関係を表現することが期待されています。結果として、デプロイメントエクステンションの依存関係は、Quarkus エクステンションの依存関係モデル (`maven-dependency-plugin`、 `go-offline-maven-plugin` など) を認識しない Maven プラグインには表示されません。つまり、これらのプラグインを使用してすべてのアプリケーションの依存関係を事前にダウンロードして、後でオフラインモードでアプリケーションをビルドおよびテストできるようにすることはできません。

source: Quarkus extension dependencies are usually configured in the same way as any other project dependencies in a project's build file, for example the Maven `pom.xml` or the Gradle build scripts. However, Quarkus also supports types of dependencies that aren't supported out-of-the-box by Maven and Gradle. Conditional Quarkus extension dependencies is one such example.
ja_jp: Quarkus エクステンションの依存関係は通常、プロジェクトのビルドファイル内の他のプロジェクト依存関係 (Maven の `pom.xml` や Gradle ビルドスクリプトなど) と同じ方法で設定されます。Quarkus は、Maven や Gradle では標準でサポートされていない種類の依存関係にも対応しています。条件付き Quarkus エクステンションの依存関係がその一例です。

source: Quarkus extension dependencies are usually configured in the same way as any other project dependencies in the project's build file, e.g. the Maven `pom.xml` or the Gradle build scripts. However, there are dependency types that aren't yet supported out-of-the-box by Maven and Gradle. What we refer here to as "conditional dependencies" is one example.
ja_jp: Quarkusエクステンションの依存関係は、通常、プロジェクトのビルドファイルにおいて、他のプロジェクトの依存関係と同じ方法で設定されます（例：Maven `pom.xml` またはGradleビルドスクリプト）。しかし、MavenやGradleではまだデフォルトではサポートされていない依存関係の種類があります。ここでいう「条件付き依存関係」はその一例です。

source: Quarkus extensions add a new developer focused behavior to the core offering, and consist of two distinct parts, buildtime augmentation and runtime container. The augmentation part is responsible for all metadata processing, such as reading annotations, XML descriptors etc. The output of this augmentation phase is recorded bytecode which is responsible for directly instantiating the relevant runtime services.
ja_jp: Quarkusのエクステンションは、コアサービスに開発者向けの新しい動作を追加するもので、ビルド時の拡張とランタイムコンテナという2つの異なる部分から構成されています。拡張部分は、アノテーションやXML記述子の読み込みなど、すべてのメタデータ処理を担当します。この拡張フェーズの出力は、関連するランタイムサービスを直接インスタンス化するためのバイトコードとして記録されます。

source: Quarkus extensions and database drivers reference
ja_jp: Quarkusエクステンションとデータベースドライバーのリファレンス

source: Quarkus extensions and the application code can use this engine to orchestrate I/O interactions, interact with databases, send and receive messages, and so on.
ja_jp: Quarkusのエクステンションとアプリケーションコードは、このエンジンを使用して、I/Oインタラクションのオーケストレーション、データベースとのインタラクション、メッセージの送受信などを行うことができます。

source: Quarkus extensions are distributed as Maven JAR artifacts that application and other libraries may depend on.
ja_jp: Quarkusのエクステンションは、アプリケーションや他のライブラリが依存する可能性のあるMaven JARアーティファクトとして配布されます。

source: Quarkus extensions are distributed as Maven JAR artifacts that application and other libraries may depend on. When a Quarkus application project is built, tested or edited using the Quarkus dev tools, Quarkus extension JAR artifacts will be identified on the application classpath by the presence of the Quarkus extension metadata files in them. This document describes the purpose of each Quarkus extension metadata file and its content.
ja_jp: Quarkus エクステンションは、アプリケーションや他のライブラリーが依存する Maven JAR アーティファクトとして配布されます。Quarkus アプリケーションプロジェクトを Quarkus 開発ツールを使用してビルド、テスト、編集すると、Quarkus エクステンション JAR アーティファクトは、その中の Quarkus エクステンションメタデータファイルの存在によって、アプリケーションクラスパス上で識別されます。このドキュメントでは、各 Quarkus エクステンションメタデータファイルの目的とその内容について説明しています。

source: Quarkus extensions can automatically pick the right services they need, while GraalVM's native-image defaults to include all services it's able to find on the classpath.
ja_jp: Quarkusのエクステンションでは、必要なサービスを自動的に選択することができますが、GraalVMのネイティブイメージのデフォルトでは、クラスパス上で見つけることができるすべてのサービスが含まれています。

source: Quarkus extensions can do a lot, or a little.
ja_jp: Quarkus エクステンションは、多くのことが出来たりも、少しのことしか出来なかったりもします。

source: Quarkus extensions can do lots of things. The xref:extension-maturity-matrix.adoc[extension maturity matrix] lays out a path through the various capabilities, with a suggested implementation order.
ja_jp: Quarkus エクステンションは多くのことを行うことができます。xref:extension-maturity-matrix.adoc[エクステンション成熟度マトリックス] は、さまざまな機能のパスを示し、推奨される実装順序を示しています。

source: Quarkus extensions can enhance the developer experience by contributing to the Dev Assistant. This section explains how to integrate your extension with the Dev Assistant, covering:
ja_jp: Quarkus エクステンションは、 Dev Assistant に寄与することで開発エクスペリエンスを向上させることができます。このセクションでは、以下を含む、エクステンションを Dev Assistant と統合する方法について説明します。

source: Quarkus extensions can enhance the developer experience by contributing to the Dev UI. The rest of this guide outlines how to integrate your extension into the Dev UI, covering metadata configuration, adding pages to the card, menu, and footer, and best practices for dynamic content.
ja_jp: Quarkus エクステンションは、Dev UI に貢献することで開発エクスペリエンスを向上させることができます。このガイドの残りの部分では、メタデータ設定、カード、メニュー、フッターへのページの追加、動的コンテンツのベストプラクティスなど、エクステンションを Dev UI に統合する方法を概説します。

source: Quarkus extensions enhance your application just as projects dependencies do. The role of the extensions is to leverage Quarkus paradigms to integrate seamlessly a library into Quarkus architecture - e.g. do more things at build time. This is how you can use your battle-tested ecosystem and take advantage of Quarkus performance and native compilation. Go to https://code.quarkus.io/[code.quarkus.io] to get the list of the supported extensions.
ja_jp: Quarkus のエクステンションは、プロジェクトの依存関係がそうであるように、アプリケーションを強化します。エクステンションの役割は、Quarkus のパラダイムを活用して、ライブラリを Quarkus アーキテクチャにシームレスに統合することです。たとえば、ビルド時に、より多くのことを行います。これが、実績のあるエコシステムを利用して、Quarkus のパフォーマンスとネイティブコンパイルを活用することができる仕組みです。 https://code.quarkus.io/[code.quarkus.io] にアクセスして、サポートされているエクステンションのリストを入手してください。

source: Quarkus extensions may declare additional discovery rules. For example, `@Scheduled` business methods are registered even if the declaring class is not annotated with a bean defining annotation.
ja_jp: Quarkus エクステンションは、追加のディスカバリールールを宣言することができます。たとえば、 `@Scheduled` ビジネスメソッドは、宣言するクラスが Bean 定義アノテーションでアノテーションされていなくても登録されます。

source: Quarkus extensions may declare in their descriptors (`META-INF/quarkus-extension.properties` found in the runtime extension JAR artifact) that they provide certain capabilities. A capability represents a technical aspect, e.g. an implementation of some functionality or a specification. Each capability has a name which should follow the Java package naming convention, e.g. `io.quarkus.rest`.
ja_jp: Quarkusエクステンションは、その記述子（ランタイムエクステンションのJARアーティファクトにある `META-INF/quarkus-extension.properties` ）において、特定の機能を提供することを宣言できます。ケイパビリティは、技術的な側面、例えば、ある機能の実装や仕様などを表します。各ケイパビリティには名前があり、Javaパッケージの命名規則に従う必要があります（例： `io.quarkus.rest` ）。

source: Quarkus extensions may provide certain capabilities and require certain capabilities to be provided by other extensions in an application to function properly.
ja_jp: Quarkusのエクステンションは、特定のケイパビリティを提供することがあり、正しく機能するために、アプリケーション内の他のエクステンションによって提供される特定のケイパビリティを必要とすることがあります。

source: Quarkus extensions optimize your applications by pushing as much work as possible to the build operation.
ja_jp: Quarkusのエクステンションは、できるだけ多くの作業をビルド操作に回すことで、アプリケーションを最適化します。

source: Quarkus extensions optimize your applications by pushing as much work as possible to the build operation. This guide explains the rationale of Quarkus extensions and guides you through authoring your own extensions.
ja_jp: Quarkusのエクステンションは、可能な限り多くの作業をビルド処理にプッシュすることで、アプリケーションを最適化します。このガイドでは、Quarkusエクステンションの根拠を説明し、独自のエクステンションを作成する方法を説明します。

source: Quarkus extensions providing blocking APIs on top of reactive APIs can be used in virtual threads. This includes the REST Client, the Redis client, the mailer...
ja_jp: リアクティブ API の上にブロッキング API を提供する Quarkus エクステンションは、仮想スレッドで使用できます。 これには、REST Client、Redis クライアント、メーラーなどが含まれます。

source: Quarkus extensions should aim to xref:writing-extensions.adoc#expose-your-components-via-cdi[expose components via CDI], so that they can be consumed in a frictionless way by user applications. Having everything injectable as CDI beans also helps testing, especially xref:getting-started-testing.adoc#mock-support[mocking].
ja_jp: Quarkus エクステンションは、ユーザーアプリケーションがスムーズに使用できるように、xref:writing-extensions.adoc#expose-your-components-via-cdi[CDI 経由でコンポーネントを公開] することを目指す必要があります。 すべてを CDI Bean として注入可能にしておくと、特に xref:getting-started-testing.adoc#mock-support[mocking] でテストにも役立ちます。

source: Quarkus extensions:
ja_jp: Quarkus エクステンション:

source: Quarkus famously has the ability to be built in standard JVM mode (the build produces .JAR files to be loaded and run by the JVM at runtime) or native mode (the build produces a native binary to be directly executed). Cryostat relies upon both JDK Flight Recorder (JFR), which is only partially supported in Quarkus native mode, and JDK Management Extensions (JMX), which is not supported in native mode at the time of writing. This means that, unfortunately, only JVM-mode Quarkus applications can be configured for use with Cryostat.
ja_jp: Quarkusは、標準のJVMモード（ビルドにより.JARファイルを生成し、ランタイムにJVMでロードして実行）またはネイティブモード（ビルドにより、直接実行するネイティブバイナリを生成）でビルドできることは有名な話です。CryostatはJDK Flight Recorder（JFR）に依存していますが、これはQuarkusのネイティブモードでは部分的にしかサポートされておらず、JDK Management Extensions（JMX）は執筆時点ではネイティブモードではサポートされていません。つまり、残念ながら、JVMモードのQuarkusアプリケーションしかCryostatで使用するように設定することができません。

source: Quarkus fast startup times and integration with SnapStart
ja_jp: Quarkusの高速な起動時間とSnapStartとの統合

source: Quarkus fires a CDI event of type `io.quarkus.websockets.next.WebSocketClientConnection` with qualifier `@io.quarkus.websockets.next.Open` asynchronously when a new connection is opened. Moreover, a CDI event of type `WebSocketClientConnection` with qualifier `@io.quarkus.websockets.next.Closed` is fired asynchronously when a connection is closed.
ja_jp: Quarkus は、新しい接続が開かれると、修飾子 `@io.quarkus.websockets.next.Open` を持つ `io.quarkus.websockets.next.WebSocketConnection` タイプの CDI イベントを非同期的に起動します。 さらに、接続が閉じられると、修飾子 `@io.quarkus.websockets.next.Closed` を持つ `WebSocketClientConnection` タイプの CDI イベントが非同期的に起動します。

source: Quarkus fires a CDI event of type `io.quarkus.websockets.next.WebSocketConnection` with qualifier `@io.quarkus.websockets.next.Open` asynchronously when a new connection is opened. Moreover, a CDI event of type `WebSocketConnection` with qualifier `@io.quarkus.websockets.next.Closed` is fired asynchronously when a connection is closed.
ja_jp: Quarkus は、新しい接続が開かれると、修飾子 `@io.quarkus.websockets.next.Open` を持つ `io.quarkus.websockets.next.WebSocketConnection` タイプの CDI イベントを非同期的に起動します。 さらに、接続が閉じられると、修飾子 `@io.quarkus.websockets.next.Closed` を持つ `WebSocketConnection` タイプの CDI イベントが非同期的に起動します。

source: Quarkus first identifies so-called _unremovable_ beans that form the roots in the dependency tree. A good example is a JAX-RS resource class or a bean which declares a `@Scheduled` method.
ja_jp: Quarkus は最初に、依存関係ツリーのルートを形成する、いわゆる _unremovable_ Bean を識別します。良い例は、JAX-RS リソースクラスまたは `@Scheduled` メソッドを宣言する Bean です。

source: Quarkus first identifies so-called _unremovable_ beans that form the roots in the dependency tree. A good example is a Jakarta REST resource class or a bean which declares a `@Scheduled` method.
ja_jp: Quarkusはまず、依存関係ツリーのルートを形成する、いわゆる _削除不可能な_ Beanを特定します。良い例は、Jakarta RESTリソースクラスや、 `@Scheduled` メソッドを宣言している Bean です。

source: Quarkus first identifies so-called _unremovable_ beans that form the roots in the dependency tree. Unremovable beans:
ja_jp: Quarkusはまず、依存関係ツリーのルートを形成する、いわゆる _削除不可能な_ Beanを特定します。削除不可能なBean:

source: Quarkus focuses on the simplest and most useful way to use a given feature, trimming it to its most useful essence. This includes upfront analysis on how to best use a feature and guiding you in what we think is the best way to do things.
ja_jp: Quarkusでは、ある機能を使用する際に、最もシンプルで便利な方法に焦点を当て、最も有用なエッセンスを抽出しています。これには、ある機能をどのように使うのがベストかを事前に分析し、私たちが考えるベストな方法をお客様にご案内することも含まれます。

source: Quarkus for the Web
ja_jp: Web 向け Quarkus

source: Quarkus forces a packaging of type `uber-jar` for your function as Google Cloud Function deployment requires a single JAR.
ja_jp: Google Cloud FunctionのデプロイにはシングルJARが必要なため、Quarkusでは強制的に `uber-jar` タイプのパッケージを作成しています。

source: Quarkus gRPC Server implements the https://github.com/grpc/grpc/blob/master/doc/server-reflection.md[reflection service]. This service allows tools like https://github.com/fullstorydev/grpcurl[grpcurl] or https://github.com/gusaul/grpcox[grpcox] to interact with your services.
ja_jp: Quarkus gRPC Serverは、 link:https://github.com/grpc/grpc/blob/master/doc/server-reflection.md[リフレクションサービス] を実装しています。このサービスを使用すると、 link:https://github.com/fullstorydev/grpcurl[grpcurl] や link:https://github.com/gusaul/grpcox[grpcox] などのツールがサービスと対話できるようになります。

source: Quarkus gRPC is based on https://vertx.io/docs/vertx-grpc/java/[Vert.x gRPC].
ja_jp: Quarkus gRPCは link:https://vertx.io/docs/vertx-grpc/java/[Vert.x gRPC] をベースにしています。

source: Quarkus generates a UUID that changes between two executions (including in dev mode). So, you are sure no other consumer uses it, and you receive a new unique group id every time your application starts.
ja_jp: Quarkus は、実行のたびに変更される UUID を生成します (dev モードを含む)。したがって、他のコンシューマーがそれを使用していないことを確認すると、アプリケーションが起動するたびに新しい一意のグループ ID を受け取ることになります。

source: Quarkus generates a few implementation classes for services declared in the `proto` file:
ja_jp: Quarkusは、 `proto` ファイルで宣言されたサービスに対して、いくつかの実装クラスを生成します。

source: Quarkus generates a lot of classes during the build phase and in many cases also transforms existing classes. It is often extremely useful to see the generated bytecode and transformed classes during the development of an extension.
ja_jp: Quarkusでは、ビルドフェーズで多くのクラスが生成され、多くの場合、既存のクラスも変換されます。エクステンションの開発中に、生成されたバイトコードや変換されたクラスを見ることができるのは、非常に便利なことです。

source: Quarkus generates a self-signed certificate if the Quarkus Development CA is not installed.
ja_jp: Quarkus 開発用 CA がインストールされていない場合、Quarkus は自己署名証明書を生成します。

source: Quarkus generates native image tracing agent configuration filters. These filters exclude commonly used packages for which Quarkus already applies the necessary configuration.
ja_jp: Quarkus はネイティブイメージトレーシングエージェント設定フィルターを生成します。 これらのフィルターは、Quarkus がすでに必要な設定を適用している、よく使用されるパッケージを除外します。

source: Quarkus handles complex authorisation differently, see link:https://quarkus.io/guides/security-authorize-web-endpoints-reference[this guide] for details
ja_jp: Quarkusでは、複雑な認可の処理方法が異なります。詳細は link:https://quarkus.io/guides/security-authorize-web-endpoints-reference[こちらのガイド] を参照してください。

source: Quarkus has 3 different launch modes, `NORMAL` (i.e. production), `DEVELOPMENT` and `TEST`. If you are running `quarkus:dev` then the mode will be `DEVELOPMENT`, if you are running a JUnit test it will be `TEST`, otherwise it will be `NORMAL`.
ja_jp: Quarkusには3種類の起動モードがあります。 `NORMAL` (つまりプロダクション)、 `DEVELOPMENT` 、 `TEST` です。 `quarkus:dev` を実行している場合は `DEVELOPMENT` 、JUnit テストを実行している場合は `TEST` 、それ以外の場合は `NORMAL` となります。

source: Quarkus has a <<cdi-reference.adoc#bean_discovery,simplified discovery>>. It might happen that the class is not part of the application index. For example, classes from the _runtime module_ of a Quarkus extension are not indexed automatically.
ja_jp: Quarkusには link:cdi-reference.html#bean_discovery[簡易ディスカバリー] があります。クラスがアプリケーションのインデックスに含まれていないことが起こるかもしれません。例えば、Quarkusエクステンションの _ランタイムモジュール_ のクラスは自動的にインデックス化されません。

source: Quarkus has a different extension for each Gateway API. The HTTP Gateway API is implemented within the `quarkus-amazon-lambda-http` extension. The REST Gateway API is implemented within the `quarkus-amazon-lambda-rest` extension. If you are confused on which Gateway product to use, Amazon has a https://docs.aws.amazon.com/apigateway/latest/developerguide/http-api-vs-rest.html[great guide] to help you navigate this decision.
ja_jp: Quarkusでは、ゲートウェイAPIごとに異なるエクステンションを用意しています。HTTP Gateway APIは、 `quarkus-amazon-lambda-http` のエクステンションで実装されています。REST Gateway APIは、 `quarkus-amazon-lambda-rest` のエクステンションで実装されています。どのGateway製品を使用すべきか迷っている場合は、Amazonが決断を助ける為に link:https://docs.aws.amazon.com/apigateway/latest/developerguide/http-api-vs-rest.html[素晴らしいガイド]を提供しています。

source: Quarkus has a number of ClassLoaders. This shows the relationship between them :
ja_jp: Quarkusには多くのClassLoadersがあります。これはそれらの関係を示しています：

source: Quarkus has a xref:cdi-reference.adoc#bean_discovery[simplified discovery]. It might happen that the class is not part of the application index. For example, classes from the _runtime module_ of a Quarkus extension are not indexed automatically.
ja_jp: Quarkusは xref:cdi-reference.adoc#bean_discovery[簡略化されたディスカバリー] があります。クラスがアプリケーションのインデックスの一部でないことがあります。例えば、Quarkusエクステンションの _実行時モジュール_ のクラスは、自動的にインデックスされません。

source: Quarkus has always been able to handle large applications, but we have recently made significant improvements in this area, particularly when it comes to build times. In this post, we will walk through some of these improvements.
ja_jp: Quarkusは常に大規模なアプリケーションを処理できましたが、特にビルド時間に関しては、この分野で最近大幅な改善を行いました。この記事では、これらの改善点の一部を詳しく説明します。

source: Quarkus has always offered several types of jar packaging. Historically, we had either a standard jar packaging (the one with the `-runner.jar` and the `lib/` directory) or an uber jar. In Quarkus 1.5, we introduced a new packaging type called Fast jar, which main objective was to further improve our boot time.
ja_jp: Quarkusでは、常にいくつかのタイプのjarパッケージを提供してきました。歴史的には、標準のjarパッケージ（ `-runner.jar` と `lib/` ディレクトリのあるもの）か、uber jarがありました。Quarkus 1.5では、Fast jarと呼ばれる新しいパッケージタイプを導入しました。その主な目的は、ブート時間の更なる改善でした。

source: Quarkus has always pushed the boundaries of developer experience: we introduced Dev Mode, pioneered the concept of Dev Services, and much more.
ja_jp: Quarkus は常に開発者エクスペリエンスの限界を押し広げてきました。私たちは開発モードを導入し、Dev Services のコンセプトを開拓するなど、多くのことを実現してきました。

source: Quarkus has an integrated pluggable web security layer.
ja_jp: Quarkusには、プラガブルなウェブセキュリティレイヤーが統合されています。

source: Quarkus has an integrated pluggable web security layer. If security is enabled all HTTP requests will have a permission check performed to make sure they are allowed to continue.
ja_jp: Quarkusには、プラグイン可能なウェブセキュリティーレイヤーが統合されています。セキュリティーが有効になっている場合、すべてのHTTPリクエストは、処理の継続が許可されているかどうかを確認するためのパーミッションチェックが実行されます。

source: Quarkus has an option to disable the SSL support entirely. Why? Because it comes at a certain cost. So if you are sure you don't need it, you can disable it entirely.
ja_jp: Quarkusには、SSLのサポートを完全に無効にするオプションがあります。なぜでしょうか?それは、一定のコストがかかるからです。ですから、必要ないと確信している場合は、完全に無効にすることができます。

source: Quarkus has been designed with this new world in mind and provides first-class support for these different paradigms. That does not mean you cannot build monoliths with Quarkus; you can do it smoothly. On the contrary, it means that the Quarkus development model morphs to adapt itself to the type of application you are developing, monolith, microservice, reactive, event-driven, functions…
ja_jp: Quarkusは、この新しい世界を念頭に置いて設計されており、これらの異なるパラダイムに対して一級のサポートを提供しています。それは、Quarkusでモノリスを構築できないということではなく、スムーズに構築することができます。それどころか、Quarkusの開発モデルは、モノリス、マイクロサービス、リアクティブ、イベントドリブン、ファンクションなど、開発しているアプリケーションの種類に合わせて変化します。

source: Quarkus has been designed with this new world in mind and provides first-class support for these paradigms. That does not mean you cannot build monoliths with Quarkus; you can do it smoothly. On the contrary, it means that the Quarkus development model morphs to adapt itself to the type of application you are developing: monoliths, microservices, CLIs, event-driven applications, functions, Kubernetes operators...
ja_jp: Quarkus はこの新しい世界を念頭に置いて設計されており、これらのパラダイムに対して第一級のサポートを提供します。だからといって、Quarkus でモノリスを構築できないわけではありません。スムーズに実行できます。それどころか、Quarkus 開発モデルは、モノリス、マイクロサービス、CLI、イベント駆動型アプリケーション、関数、Kubernetes オペレーターなど、開発中のアプリケーションの種類に合わせて変化します。

source: Quarkus has been using Micrometer to collect metrics from the application for a long time. Almost all the out-of-the-box metrics instrumentation in Quarkus are implemented with Micrometer.
ja_jp: Quarkus は長い間、アプリケーションからメトリクスを収集するために Micrometer を使用してきました。Quarkus のすぐに使用できるメトリクス計装のほぼすべてが Micrometer で実装されています。

source: Quarkus has been using Micrometer to collect metrics from the application for a long time. Almost all the out-of-the-box metrics instrumentation in Quarkus are implemented with the xref:telemetry-micrometer.adoc[Micrometer] extension.
ja_jp: Quarkus は長い間、アプリケーションからメトリクスを収集するために Micrometer を使用してきました。Quarkus のすぐに使用できるメトリクス計装のほぼすべてが、xref:telemetry-micrometer.adoc[Micrometer] エクステンションで実装されています。

source: Quarkus has built-in capabilities to deal with JSON AMQP messages.
ja_jp: Quarkus には、JSON AMQP メッセージを扱う機能が組み込まれています。

source: Quarkus has built-in capabilities to deal with JSON Kafka messages.
ja_jp: Quarkus には、JSON Kafka メッセージを扱う機能が組み込まれています。

source: Quarkus has built-in capabilities to deal with JSON Kafka messages. In a following section, we will create serializer/deserializer classes for Jackson.
ja_jp: Quarkus には、JSON Kafka メッセージを処理する機能が組み込まれています。次のセクションでは、Jackson のシリアライザー/デシリアライザークラスを作成します。

source: Quarkus has built-in capabilities to deal with JSON Pulsar messages. In a following section, we will create serializer/deserializer classes for Jackson.
ja_jp: Quarkus には、JSON Pulsar メッセージを処理する機能が組み込まれています。次のセクションでは、Jackson のシリアライザー/デシリアライザークラスを作成します。

source: Quarkus has built-in capabilities to deal with JSON RabbitMQ messages.
ja_jp: QuarkusにはJSONのRabbitMQメッセージを処理する機能が組み込まれています。

source: Quarkus has built-in support for JSON serialization and deserialization based on Jackson. It will also <<serialization-generation, generate>> the serializer and deserializer for you, so you do not have to configure anything. When generation is disabled, you can use the provided `ObjectMapperSerializer` and `ObjectMapperDeserializer` as explained below.
ja_jp: Quarkus には、Jackson に基づく JSON シリアライゼーションとデシリアライゼーションのサポートが組み込まれています。また、シリアライザーとデシリアライザーを <<serialization-generation, 生成>> してくれるため、何も設定する必要がありません。生成が無効になっている場合は、以下で説明するように、提供されている `ObjectMapperSerializer` および `ObjectMapperDeserializer` を使用することができます。

source: Quarkus has built-in support for JSON serialization and deserialization based on Jackson. It will also <<serialization-generation,generate>> the serializer and deserializer for you, so you do not have to configure anything. When generation is disabled, you can use the provided `ObjectMapperSerializer` and `ObjectMapperDeserializer` as explained below.
ja_jp: Quarkus には、Jackson に基づく JSON シリアライゼーションとデシリアライゼーションのサポートが組み込まれています。また、シリアライザーとデシリアライザーを <<serialization-generation,生成>> してくれるため、何も設定する必要がありません。 生成が無効になっている場合は、以下で説明するように、提供されている `ObjectMapperSerializer` および `ObjectMapperDeserializer` を使用できます。
